print("-----------------------欢迎光临小王的服装商店--------------------------------")
print(" 日期        服装名称        价格/件        本月库存数量        销售量/每日")
print(" 1号         羽绒服          253.6          500               10")
print(" 2号         牛仔裤          86.3           600               60")
print(" 3号         风衣            96.8           335               43")
print(" 4号         皮草            135.9          855               63")
print(" 5号         T血            65.8           632               63")
print(" 6号         衬衫           49.3           562               120")
print(" 7号         牛仔裤          86.3           600               72")
print(" 8号         羽绒服          253.6          500               69")
print(" 9号         牛仔裤          86.3           600               35")
print(" 10号        羽绒服          253.6          500               140")
print(" 11号        牛仔裤          86.3           600               90")
print(" 12号        皮草            135.9          855               24")
print(" 13号        T血            65.8           632               45")
print(" 14号        风衣            96.8           335               25")
print(" 15号        牛仔裤          86.3           600               60")
print(" 16号        T血            65.8           632               129")
print(" 17号        羽绒服          253.6          500               10")
print(" 18号        风衣            96.8           335               43")
print(" 19号        T血            65.8           632               63")
print(" 20号        牛仔裤          86.3           600               60")
print(" 21号        皮草            135.9          855               63")
print(" 22号        风衣            96.8           335               60")
print(" 23号        T血            65.8           632               58")
print(" 24号        牛仔裤          86.3           600               140")
print(" 25号        T血            65.8           632               48")
print(" 26号        风衣            96.8           335               43")
print(" 27号        皮草            135.9          855               57")
print(" 28号        羽绒服          253.6          500               10")
print(" 29号        T血            65.8           632               63")
print(" 30号        风衣            96.8           335               78")

羽绒服=(10+69+140+10+10)*253.6
羽绒服=round(羽绒服,2)
牛仔裤=(60+72+35+90+60+60+140)*86.3
牛仔裤=round(牛仔裤,2)
风衣=(43+25+43+60+43+78)*96.8
风衣=round(风衣,2)
皮草=(63+24+63+57)*135.9
皮草=round(皮草,2)
T恤=(63+45+129+63+58+48+63)*65.8
T恤=round(T恤,2)
衬衫=49.3*120
衬衫=round(衬衫,2)

print()
print("总销售额：")
print("羽绒服：",羽绒服)
print("牛仔裤：",牛仔裤)
print("风衣：",风衣)
print("皮草：",皮草)
print("T恤：",T恤)
print("衬衫：",衬衫)
print()

羽绒服=羽绒服/253.6/5
羽绒服=round(羽绒服,2)
牛仔裤=牛仔裤/86.3/7
牛仔裤=round(牛仔裤,2)
风衣=风衣/96.8/6
风衣=round(风衣,2)
皮草=皮草/135.9/4
皮草=round(皮草,2)
T恤=T恤/65.8/7
T恤=round(T恤,2)
衬衫=衬衫/49.3/1
衬衫=round(衬衫,2)

print("平均日销量：")
print("羽绒服：",羽绒服,"件/天")
print("牛仔裤：",牛仔裤,"件/天")
print("风衣：",风衣,"件/天")
print("皮草：",皮草,"件/天")
print("T恤：",T恤,"件/天")
print("衬衫：",衬衫,"件/天")
print()

羽绒服=(10+69+140+10+10)/(10+69+140+10+10+60+72+35+90+60+60+140+43+25+43+60+43+78+63+24+63+57+63+45+129+63+58+48+63+120)*100
羽绒服=round(羽绒服,1)
牛仔裤=(60+72+35+90+60+60+140)/(10+69+140+10+10+60+72+35+90+60+60+140+43+25+43+60+43+78+63+24+63+57+63+45+129+63+58+48+63+120)*100
牛仔裤=round(牛仔裤,1)
风衣=(43+25+43+60+43+78)/(10+69+140+10+10+60+72+35+90+60+60+140+43+25+43+60+43+78+63+24+63+57+63+45+129+63+58+48+63+120)*100
风衣=round(风衣,1)
皮草=(63+24+63+57)/(10+69+140+10+10+60+72+35+90+60+60+140+43+25+43+60+43+78+63+24+63+57+63+45+129+63+58+48+63+120)*100
皮草=round(皮草,1)
T恤=(63+45+129+63+58+48+63)/(10+69+140+10+10+60+72+35+90+60+60+140+43+25+43+60+43+78+63+24+63+57+63+45+129+63+58+48+63+120)*100
T恤=round(T恤,1)
衬衫=(120)/(10+69+140+10+10+60+72+35+90+60+60+140+43+25+43+60+43+78+63+24+63+57+63+45+129+63+58+48+63+120)*100
衬衫=round(衬衫,1)

print("月销量占比：")
print("羽绒服：",羽绒服,"%")
print("牛仔裤：",牛仔裤,"%")
print("风衣：",风衣,"%")
print("皮草：",皮草,"%")
print("T恤：",T恤,"%")
print("衬衫：",衬衫,"%")
print()

